
&НаСервере
Функция ПолучитьЧасовуюСтавку(Контрагент, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧасовыеСтавкиСрезПоследних.ЧасоваяСтавка КАК ЧасоваяСтавка
		|ИЗ
		|	РегистрСведений.ЧасовыеСтавки.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ЧасовыеСтавкиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЧасоваяСтавка
	Иначе
		Возврат 0
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Процедура ИзменитьСтатусЗадачи(Ссылка, Статус) Экспорт
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	ДокументОбъект.Статус = Статус;
	
	Если Статус = Справочники.СтатусыЗадач.ВРаботе И НЕ ЗначениеЗаполнено(Ссылка.ДатаНачала) Тогда
		ДокументОбъект.ДатаНачала = ТекущаяДата();
	КонецЕсли;
	
	Если Статус = Справочники.СтатусыЗадач.Выполнена ИЛИ 
		Статус = Справочники.СтатусыЗадач.НаПроверке ИЛИ
		Статус = Справочники.СтатусыЗадач.Отменена И НЕ 
		ЗначениеЗаполнено(Ссылка.ДатаЗавершения) Тогда
		ДокументОбъект.ДатаЗавершения = ТекущаяДата();
	КонецЕсли;

	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
