
&НаСервере
Функция ПолучитьЧасовуюСтавку(Контрагент, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧасовыеСтавкиСрезПоследних.ЧасоваяСтавка КАК ЧасоваяСтавка
		|ИЗ
		|	РегистрСведений.ЧасовыеСтавки.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ЧасовыеСтавкиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЧасоваяСтавка
	Иначе
		Возврат 0
	КонецЕсли;
	
	
КонецФункции