
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыОбороты.Задача КАК Задача,
	|	ВзаиморасчетыОбороты.СуммаОборот - ВзаиморасчетыОбороты.ОплаченоОборот КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Обороты(, , , Контрагент = &Контрагент) КАК ВзаиморасчетыОбороты";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаКОплате = Объект.Сумма;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() И СуммаКОплате > 0  Цикл
		Если ВыборкаДетальныеЗаписи.СуммаОстаток = 0 Тогда
			Продолжить
		КонецЕсли;
		
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.Заказ = ВыборкаДетальныеЗаписи.Задача;
		НоваяСтрока.Сумма = ?(СуммаКОплате >= ВыборкаДетальныеЗаписи.СуммаОстаток, ВыборкаДетальныеЗаписи.СуммаОстаток, СуммаКОплате);
		
		СуммаКОплате = СуммаКОплате - НоваяСтрока.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
