
&НаСервере
Процедура ВыгрузитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Информация.Ссылка КАК Ссылка,
		|	Информация.ПометкаУдаления КАК ПометкаУдаления,
		|	Информация.Родитель КАК Родитель,
		|	Информация.ЭтоГруппа КАК ЭтоГруппа,
		|	Информация.Наименование КАК Наименование,
		|	Информация.ТекстКода КАК ТекстКода
		|ИЗ
		|	Справочник.Информация КАК Информация
		|ГДЕ
		|	НЕ Информация.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПолныйПуть = "";
		
		Родитель = ВыборкаДетальныеЗаписи.Ссылка.Родитель;
		
		ПолныйПуть = Родитель;
		
		
		Пока ЗначениеЗаполнено(Родитель.Родитель) Цикл
			Родитель = Родитель.Родитель;
			
		    ПолныйПуть = Родитель.Наименование + "\" + ПолныйПуть;
			
		КонецЦикла;
		
		КаталогСохранения = Каталог.ПолныйПутьWindows + "\База данных\" + ПолныйПуть + "\";
		СоздатьКаталог(КаталогСохранения);
		
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		ТекстовыйФайл.УстановитьТекст(ВыборкаДетальныеЗаписи.ТекстКода);
		ТекстовыйФайл.Записать(КаталогСохранения  + ВыборкаДетальныеЗаписи.Наименование + ".bsl");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры
