
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПланировщикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи.Ссылка КАК Ссылка,
		|	Задачи.ДатаНачала КАК ДатаНачала,
		|	Задачи.ДатаОкончания КАК ДатаОкончания,
		|	Задачи.ТекстЗадачи КАК ТекстЗадачи,
		|	Задачи.Выполнено КАК Выполнено,
		|	Задачи.Приоритет КАК Приоритет,
		|	Задачи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Задачи КАК Задачи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		НовыйЭлемент = Планировщик.Элементы.Добавить(ВыборкаДетальныеЗаписи.ДатаНачала, ВыборкаДетальныеЗаписи.ДатаОкончания);
		НовыйЭлемент.Текст = ВыборкаДетальныеЗаписи.Наименование;
		НовыйЭлемент.Значение = ВыборкаДетальныеЗаписи.Ссылка;
					
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);

	ОткрытьФорму("Справочник.Задачи.ФормаОбъекта", ПараметрыФормы, ,ЭтаФорма);

КонецПроцедуры


