

Функция GET_ВыполнитьЗапрос(Сервер, Запрос, Параметры = "", ВходящиеЗаголовки = "") Экспорт
	
	Соединение = Новый HTTPСоединение(Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки  = Новый Соответствие;		
	Заголовки.Вставить("Authorization","Bearer " + РегистрыСведений.НастройкиПодключенияГуглСервисов.ПолучитьТокен());
	
	Если ВходящиеЗаголовки <> "" Тогда
		
		Для Каждого Заголовок Из ВходящиеЗаголовки Цикл
			Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры <> "" Тогда
		
		Для Каждого ПараметрЗапроса Из Параметры Цикл
			
			Запрос = Запрос + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение + "&";
			
		КонецЦикла;
		
		Запрос = Лев(Запрос, СтрДлина(Запрос) - 1);
		
	КонецЕсли;
	
	
	ЗапросHTTP = Новый HTTPЗапрос(Запрос, Заголовки);
	Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);	
	
	Если НЕ Ответ.КодСостояния = 200 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка получения параметров авторизации: %1", Ответ.ПолучитьТелоКакСтроку()));	
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Результат", Результат);
	СтруктураОтвета.Вставить("ТекстОтвета", Ответ.ПолучитьТелоКакСтроку());
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция POST_ВыполнитьЗапрос(Сервер, Запрос, Параметры = "", ВходящиеЗаголовки = "", ДанныеДляЗапроса = "") Экспорт
	
	Соединение = Новый HTTPСоединение(Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки  = Новый Соответствие;		
	Заголовки.Вставить("Authorization","Bearer " + РегистрыСведений.НастройкиПодключенияГуглСервисов.ПолучитьТокен());
	
	Если ВходящиеЗаголовки <> "" Тогда
		
		Для Каждого Заголовок Из ВходящиеЗаголовки Цикл
			Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры <> "" Тогда
		
		Для Каждого ПараметрЗапроса Из Параметры Цикл
			
			Запрос = Запрос + ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение + "&";
			
		КонецЦикла;
		
		Запрос = Лев(Запрос, СтрДлина(Запрос) - 1);
		
	КонецЕсли;
	
	
	ЗапросHTTP = Новый HTTPЗапрос(Запрос, Заголовки);
	ЗапросHTTP.УстановитьТелоИзСтроки(ДанныеДляЗапроса);
	Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);	
	
	Если НЕ Ответ.КодСостояния = 200 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка получения параметров авторизации: %1", Ответ.ПолучитьТелоКакСтроку()));	
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Результат", Результат);
	СтруктураОтвета.Вставить("ТекстОтвета", Ответ.ПолучитьТелоКакСтроку());
	
	Возврат СтруктураОтвета;
	
	
КонецФункции

&НаСервере
Функция ДатаВФорматеGoogle(Дата) Экспорт
	Возврат Формат(Дата, "ДФ='yyyy-MM-dd''T''HH:mm:ssZ'")
КонецФункции // ДатаВФорматеЧЗ()

&НаСервере
Функция ДатаИзФорматаGoogle(ДатаGoogle) Экспорт
	Возврат Дата(Лев(ДатаGoogle, 4) + Сред(ДатаGoogle, 6, 2) + Сред(ДатаGoogle, 9, 2) + Сред(ДатаGoogle, 12, 2) + Сред(ДатаGoogle, 15, 2));
КонецФункции // ДатаВФорматеЧЗ()

