
&НаКлиенте
Процедура СтрокаHTMLДокументСформирован(Элемент)
	
	URL = Элементы.СтрокаHTML.Документ.URL;
	
	Если СтрНайти(URL, "code=") Тогда
		code = Сред(URL, Найти(URL, "=") + 1);
		code = Сред(code, 0, Найти(code, "scope") - 1);
		ЗаписатьНастройкуНаСервере(code);
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкуНаСервере(code)
	
	РегистрыСведений.НастройкиПодключенияГуглСервисов.ЗаписатьЗначениеНастройки(Перечисления.ВариантыНастроекГуглСервисов.code, code);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокНастроек = РегистрыСведений.НастройкиПодключенияГуглСервисов.ПолучитьСписокНастроек();
	
	ПараметрыЗапроса = "response_type=code"+"&";
	ПараметрыЗапроса = ПараметрыЗапроса + "client_id="+ СписокНастроек[ПредопределенноеЗначение("Перечисление.ВариантыНастроекГуглСервисов.ClientID")] + "&";
	ПараметрыЗапроса = ПараметрыЗапроса + "redirect_uri=http://localhost&";
	ПараметрыЗапроса = ПараметрыЗапроса + "&access_type=offline" + "&";
	ПараметрыЗапроса = ПараметрыЗапроса + "&approval_prompt=force" + "&";
	
	ПараметрыЗапроса = ПараметрыЗапроса + "scope=https://www.googleapis.com/auth/tasks https://www.googleapis.com/auth/calendar https://www.googleapis.com/auth/calendar.events";
	АдресАвторизации = "https://accounts.google.com/o/oauth2/auth" + "?";
	ПолныйАдресАвторизации = АдресАвторизации + ПараметрыЗапроса;
	СтрокаHTML = ПолныйАдресАвторизации;
	КонецПроцедуры
//['https://www.googleapis.com/auth/analytics.readonly']