
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыгрузитьНаСервере()	
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере() 
	
	  //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Информация.Ссылка КАК Ссылка,
		|	Информация.ПометкаУдаления КАК ПометкаУдаления,
		|	Информация.Родитель КАК Родитель,
		|	Информация.ЭтоГруппа КАК ЭтоГруппа,
		|	Информация.Наименование КАК Наименование,
		|	Информация.ТекстКода КАК ТекстКода
		|ИЗ
		|	Справочник.Информация КАК Информация
		|ГДЕ
		|	НЕ Информация.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		ТекстовыйФайл.УстановитьТекст(ВыборкаДетальныеЗаписи.ТекстКода);
		ТекстовыйФайл.Записать("D:\" + ВыборкаДетальныеЗаписи.Наименование + ".bsl");
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры
