
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Работы Расход
	Движения.Работы.Записывать = Истина;
	Движение = Движения.Работы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Заказчик = Заказчик;
	Движение.ЗатратыВремени = ЗатратыВремени;
	Движение.Конфигурация = Конфигурация;
	Движение.Статус = Статус;

	// регистр Взаиморасчеты Расход
	
	Если Статус.Закрыта Тогда
		Движения.Взаиморасчеты.Записывать = Истина;
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;                     
		Движение.Задача = Ссылка;
		Движение.Контрагент = Заказчик;
		Движение.Сумма = СуммаЗаказа;
	Иначе
		// TODO Описание удаление движений
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если Статус = Справочники.СтатусыЗадач.ВРаботе И НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
	//	ЭтотОбъект.ДатаНачала = ТекущаяДата();
	//КонецЕсли;
	//
	//Если Статус = Справочники.СтатусыЗадач.Выполнена ИЛИ Статус = Справочники.СтатусыЗадач.НаПроверке И НЕ ЗначениеЗаполнено(ДатаЗавершения) Тогда
	//	ЭтотОбъект.ДатаЗавершения = ТекущаяДата();
	//КонецЕсли;
	//
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		Если Статус = Справочники.СтатусыЗадач.ВРаботе И НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ЭтотОбъект.ДатаНачала = ТекущаяДата();
	КонецЕсли;
	
	Если Статус = Справочники.СтатусыЗадач.Выполнена ИЛИ Статус = Справочники.СтатусыЗадач.НаПроверке И НЕ ЗначениеЗаполнено(ДатаЗавершения) Тогда
		ЭтотОбъект.ДатаЗавершения = ТекущаяДата();
	КонецЕсли;
	

КонецПроцедуры
