
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ХранилищеТекстаЗадачи = Новый ХранилищеЗначения(ТекстЗадачи)
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТекстЗадачи = ТекущийОбъект.ХранилищеТекстаЗадачи.Получить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.СтатусЗадачи = Справочники.СтатусыЗадач.Новая;
		Объект.ДатаСоздания = ТекущаяДата();
		Объект.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
