

&НаКлиенте
Процедура НачатьРаботу(Команда)

	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;
	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.ВРаботе"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередатьНаПроверку(Команда)
	
	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;
	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.НаПроверке"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура Завершить(Команда)
	
	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;

	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.Выполнена"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


Процедура ИзменитьСтатусТекущейСтроки(Ссылка, Статус);
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	ДокументОбъект.Статус = Статус;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ВывестиИнформацияПоЗадаче(ТекущаяСтрока);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ВывестиИнформацияПоЗадаче(Ссылка);
	
	Если ЗначениеЗаполнено(Ссылка.Проект) И ТИПЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		
		ТекстЗадачи = Ссылка.ХранилищеТехническогоЗадания.Получить();
		Заказчик = Ссылка.Заказчик;
		НормаВремени = Ссылка.ЗатратыВремени;
		Сумма = Ссылка.СуммаЗаказа;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСчетНаОплатуНаСервере(ВыделенныеСтроки)
	
	НовыйДокумент = Документы.СчетНаОплату.СоздатьДокумент();
	НовыйДокумент.Контрагент = ВыделенныеСтроки[0].Заказчик;
	НовыйДокумент.Дата = ТекущаяДата();
	
	Для Каждого ОбъектМассива Из ВыделенныеСтроки Цикл
		
		НовыйДокументСтрока = НовыйДокумент.Документы.Добавить();
		НовыйДокументСтрока.Заказ = ОбъектМассива;
		ЗаполнитьЗначенияСвойств(НовыйДокументСтрока, ОбъектМассива);
		
	КонецЦикла;
	
	НовыйДокумент.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСчетНаОплату(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	СформироватьСчетНаОплатуНаСервере(ВыделенныеСтроки);
	
КонецПроцедуры
