

&НаКлиенте
Процедура НачатьРаботу(Команда)

	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;
	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.ВРаботе"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередатьНаПроверку(Команда)
	
	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;
	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.НаПроверке"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура Завершить(Команда)
	
	СсылкаНаЗаказ = Элементы.Список.ТекущаяСтрока;
	
	Если Не ЗначениеЗаполнено(СсылкаНаЗаказ) ИЛИ НЕ ТипЗнч(СсылкаНаЗаказ) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		Возврат
	КонецЕсли;

	
	ИзменитьСтатусТекущейСтроки(СсылкаНаЗаказ, ПредопределенноеЗначение("Справочник.СтатусыЗадач.Выполнена"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


Процедура ИзменитьСтатусТекущейСтроки(Ссылка, Статус);
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	ДокументОбъект.Статус = Статус;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	
КонецПроцедуры
