
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ВывестиИнформацияПоЗаказу(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиИнформацияПоЗаказу(Ссылка);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаРаботу") Тогда
		
		Если ЗначениеЗаполнено(Ссылка.Проект) Тогда
			
			ТекстЗаказа = Ссылка.ХранилищеТехническогоЗадания.Получить();
			Заказчик = Ссылка.Заказчик;
			НормаВремени = Ссылка.ЗатратыВремени;
			Сумма = Ссылка.СуммаЗаказа;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.СписокЗадач.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ВывестиИнформацияПоЗадаче(ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиИнформацияПоЗадаче(Ссылка);
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.МоиЗадачи") Тогда
		
		Если НЕ Ссылка.ЭтоГруппа Тогда
			
			ТекстЗадачи = Ссылка.ХранилищеТекстаЗадачи.Получить();
			Контакт = Ссылка.Контакт;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	//Получаем схему из макета
	СхемаКомпоновкиДанных = ОбъектОбработка.ПолучитьМакет("Макет1");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	Результат = Элементы.Результат;
	Результат.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);   
КонецПроцедуры
